{
  "Are you sure to initialize the repository? It may override what you have now.": "",
  "As long as you set the proper access token below, you're logged in.": "",
  "Check it.": "",
  "Config": "",
  "Config page": "",
  "Did you create your access token? Set it up here:": "",
  "Draft": "",
  "English": "",
  "Enter your access token": "",
  "ex) ": "",
  "Failed to access the repository.": "",
  "GitHub Notes is a tool that open source version of Apple Notes or Google Keep which stores notes in your GitHub repository. So it is actually depending on Microsoft but having much better control. All your notes are written as markdown documents.": "",
  "GitHub Personal access token": "",
  "GitHub repository to store your notes": "",
  "Home": "",
  "Initialize": "",
  "Initialize repository": "",
  "Japanese": "",
  "Login": "",
  "Logout": "",
  "Note that it can take long time based on number of notes": "",
  "Notes": "",
  "Processing...": "",
  "Recreate database index": "",
  "Recreate index": "",
  "Remove above token to logout.": "",
  "Repository should look like <code>git@github.com:{your-login}/{your-repo}.git</code>": "",
  "Search notes": "",
  "The repogitory is public. So anyone can read your notes.": "",
  "The secret will be stored in your browser so no one except you can check the value.": "",
  "Unknown": "",
  "You can recreate database index by pushing following button. You don't need to do this usually because it should be done automatically. But in case your database index is broken due to for example race condition, you can fix the problem by recreating database index.": "",
  "You need to create a personal token via <a href=\"https://github.com/settings/tokens/new\" target=\"_blank\">this page</a> to use this tool. And the access token should have \"repo\" permission which provides full control of private repositories. So you may be worried if this tool does something bad. In that case, you can always check the <a href=\"https://github.com/otchy210/github-notes\" target=\"_blank\"> source code </a> of this tool and confirm there is no problem.": "",
  "Your access token configured above has to have permissions to read and write this repository. Also, it's recommended to make your repository private. Otherwise, anyone can read your notes.": "",
  "Your notes will be storead in this repository. It's highly recommended to create a dedicated repository for this purpose.": "",
  "Your repository has somewhat invalid state. Make sure it's expected then you can click following button to initialize it.": "",
  "Your repository is not yet initialized. Click following button to initialize it.": "",
  "Your repository is ready to use.": "",
  "Your repository need some folders to store notes and metadata. So you need to initialize your repository before using it.": "",
  "Your repository returns an error. You may find the hint in the DevTools console. If the repository is just empty, you need to push initial commit first to start using this repository.": ""
}
