{
  "Add new notes!": "新しいメモを追加！",
  "Are you sure to initialize the repository? It may override what you have now.": "本当にリポジトリを初期化しますか？この操作で今存在するデータが上書きされる可能性があります。",
  "As long as you set the proper access token below, you're logged in.": "適切なアクセストークンを設定することでログイン出来ます。",
  "Check it.": "確認する。",
  "Config": "設定",
  "Config page": "設定ページ",
  "Did you create your access token? Set it up here:": "アクセストークンを作成したらここで設定して下さい：",
  "Draft": "下書き",
  "English": "英語",
  "Enter your access token": "アクセストークンを入力",
  "ex) ": "例: ",
  "Failed to access the repository.": "リポジトリにアクセス出来ませんでした。",
  "GitHub Notes is a tool that open source version of Apple Notes or Google Keep which stores notes in your GitHub repository. So it is actually depending on Microsoft but having much better control. All your notes are written as markdown documents.": "GitHub Notes は GitHub レポジトリにメモを保存する、オープンソースバージョンの Apple メモあるいは Google Keep です。したがって、実際の所 Microsoft に依存してはいますが、はるかにオープンに管理されています。また、全てのメモは Markdown で保存されます。",
  "GitHub Personal access token": "GitHub アクセストークン",
  "GitHub repository to store your notes": "メモを保存する GitHub のリポジトリ",
  "Home": "ホーム",
  "Initialize": "初期化",
  "Initialize repository": "リポジトリの初期化",
  "Japanese": "日本語",
  "Login": "ログイン",
  "Logout": "ログアウト",
  "Note that it can take long time based on number of notes": "メモの数によっては非常に長い時間がかかることに留意して下さい。",
  "Notes": "メモ",
  "Processing...": "処理中...",
  "Recreate database index": "データベースインデックスの再作成",
  "Recreate index": "インデックスの再作成",
  "Remove above token to logout.": "上記のアクセストークンを削除するとログアウト出来ます。",
  "Repository should look like <code>git@github.com:{your-login}/{your-repo}.git</code>": "リポジトリは以下のようなフォーマットで指定して下さい。<code>git@github.com:{ログインID}/{リポジトリ名}.git</code>",
  "Search notes": "メモを検索",
  "The repogitory is public. So anyone can read your notes.": "リポジトリが公開状態になっているため、誰でもあなたのメモを読むことが出来ます。",
  "The secret will be stored in your browser so no one except you can check the value.": "アクセストークンはブラウザに保存されるため、あなた以外の人がその値を確認することは出来ません。",
  "Unknown": "不明",
  "You can recreate database index by pushing following button. You don't need to do this usually because it should be done automatically. But in case your database index is broken due to for example race condition, you can fix the problem by recreating database index.": "以下のボタンを押すことでデータベースのインデックスを再作成する事が出来ます。本来なら自動的に行われるので普段はこれを手動で行う必要はありません。ただ、例えば複数のメモの更新処理が競合してインデックスが不正な状態になってしまった場合などに、インデックスの再作成を行う事で問題を修正することが出来ます。",
  "You need to create a personal token via <a href=\"https://github.com/settings/tokens/new\" target=\"_blank\">this page</a> to use this tool. And the access token should have \"repo\" permission which provides full control of private repositories. So you may be worried if this tool does something bad. In that case, you can always check the <a href=\"https://github.com/otchy210/github-notes\" target=\"_blank\"> source code </a> of this tool and confirm there is no problem.": "このツールを使うためには<a href=\"https://github.com/settings/tokens/new\" target=\"_blank\">このページ</a>でアクセストークンを生成する必要があります。またアクセストークンにはレポジトリの操作を全て許可する \"repo\" 権限を持たせて下さい。このツールが何か悪さをするんじゃないかと心配になるかもしれませんが、その場合は、常にこのツールの<a href=\"https://github.com/otchy210/github-notes\" target=\"_blank\">ソースコード</a>を読んで問題無いことを確認出来ます。",
  "Your access token configured above has to have permissions to read and write this repository. Also, it's recommended to make your repository private. Otherwise, anyone can read your notes.": "設定されたアクセストークンはこのリポジトリを読み書きする権限を持っている必要があります。またリポジトリは非公開 (プライベート) 設定が推奨です。そうでない限り、誰でもあなたのメモを読むことが出来ます。",
  "Your notes will be storead in this repository. It's highly recommended to create a dedicated repository for this purpose.": "あなたのメモはこのリポジトリに保存されます。GitHub Notes 専用のリポジトリを作成することを強く推奨します。",
  "Your repository has somewhat invalid state. Make sure it's expected then you can click following button to initialize it.": "このリポジトリは何らか不正な状態になっています。想定されたエラーの場合は以下のボタンをクリックして初期化することが出来ます。",
  "Your repository is not yet initialized. Click following button to initialize it.": "このリポジトリはまだ初期化されていません。以下のボタンをクリックして初期化して下さい。",
  "Your repository is ready to use.": "このリポジトリは使用出来ます。",
  "Your repository need some folders to store notes and metadata. So you need to initialize your repository before using it.": "リポジトリにはメモやメタデータを保存するためのフォルダが必要なので、使用を始める前にリポジトリを初期化する必要があります。",
  "Your repository returns an error. You may find the hint in the DevTools console. If the repository is just empty, you need to push initial commit first to start using this repository.": "リポジトリがエラーを返しました。開発者ツールのコンソールで何か問題を解決するヒントが見つかるかもしれません。リポジトリが全くの空の場合は、リポジトリの使用を開始する前に最初のコミットをプッシュする必要があります。"
}
